tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "python@3.10"
brew "gnutls"
brew "emacs"
brew "cask"
brew "clang-format"
brew "gh"
brew "gnupg"
brew "go"
brew "k9s"
brew "neovim"
brew "nmap"
brew "node"
brew "openjdk"
brew "pipes-sh"
brew "virtualenv"
brew "pre-commit"
brew "pyenv"
brew "shellcheck"
brew "tcl-tk", link: false
brew "telnet"
brew "tmux"
brew "vim"
brew "wget"
brew "yamllint"
brew "zenith"
cask "adoptopenjdk8"
cask "font-hack-nerd-font"
cask "rectangle"
cask "stats"
vscode "aaron-bond.better-comments"
vscode "abusaidm.html-snippets"
vscode "akamud.vscode-theme-onedark"
vscode "blzjns.vscode-raml"
vscode "codezombiech.gitignore"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "emilast.LogFileHighlighter"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "golang.go"
vscode "jeandeaual.scheme"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "rebornix.scheme"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "RobbOwen.synthwave-vscode"
vscode "rogalmic.bash-debug"
vscode "shakram02.bash-beautify"
vscode "twxs.cmake"
vscode "vincaslt.highlight-matching-tag"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "yzane.markdown-pdf"
